package projects.numberToString;

import org.testng.annotations.DataProvider;

public class ConverterTestDataProvider {
    static final long maxValidNumber = ((long) Math.pow(10, 15)) - 1;
    static final long minValidNumber = (long) ((Math.pow(10, 15)) * -1 + 1);

    @DataProvider (name = "conditionsConverterTest")
    public static Object[][] dataProviderConverterTest(){
        return new Object[][] {
                {0, "ноль"},
                {8L, "восемь"},
                {21L,"двадцать один"},
                {143L, "сто сорок три"},
                {12012L, "двенадцать тысяч двенадцать"},
                {1031000L, "один миллион тридцать одна тысяча"},
                {2042000L, "два миллиона сорок две тысячи"},
                {3053000L,"три миллиона пятьдесят три тысячи" },
                {5011000L, "пять миллионов одиннадцать тысяч"},
                {105065000L, "сто пять миллионов шестьдесят пять тысяч"},
                {1010100013L, "один миллиард десять миллионов сто тысяч тринадцать"},
                {4576345213L, "четыре миллиарда пятьсот семьдесят шесть миллионов " +
                                "триста сорок пять тысяч двести тринадцать"},
                {6000100001L, "шесть миллиардов сто тысяч один"},
                {104560090L, "сто четыре миллиона пятьсот шестьдесят тысяч девяносто"},
                {1000000000L, "один миллиард"},
                {100100001001L, "сто миллиардов сто миллионов одна тысяча один"},
                {maxValidNumber, "девятьсот девяносто девять триллионов " +
                        "девятьсот девяносто девять миллиардов " +
                        "девятьсот девяносто девять миллионов " +
                        "девятьсот девяносто девять тысяч " +
                        "девятьсот девяносто девять"},
                {minValidNumber, "минус девятьсот девяносто девять триллионов " +
                        "девятьсот девяносто девять миллиардов " +
                        "девятьсот девяносто девять миллионов " +
                        "девятьсот девяносто девять тысяч " +
                        "девятьсот девяносто девять"}
        };
    }
}
